---
kind: method
id: M:Autodesk.Revit.DB.FaceDetailNode.GetInstanceTransform
source: html/0773586a-82ec-a5c5-2f76-4ee2b754340e.htm
---
# Autodesk.Revit.DB.FaceDetailNode.GetInstanceTransform Method

Returns instance transform of the object being drawn.

## Syntax (C#)
```csharp
public Transform GetInstanceTransform()
```